package internal;

import java.io.BufferedWriter;
import java.io.File;
import java.io.FileOutputStream;
import java.io.FileReader;
import java.io.FileWriter;
import java.io.IOException;
import java.io.InputStream;
import java.io.InputStreamReader;
import java.io.Reader;
import java.net.URISyntaxException;
import java.util.ArrayList;
import java.util.StringTokenizer;

public class ImportData {
	ArrayList<Class> classList;
	File csv;
	public static final String PREFIX = "stream2file";
	public static final String SUFFIX = ".tmp";

	public ImportData() throws NumberFormatException, IOException, URISyntaxException {
		// TODO Auto-generated constructor stub
		classList = new ArrayList<Class>();

		//csv = stream2file(getClass().getResourceAsStream("timetable.csv"));
		// csv = new File(getClass().getResource("/res/timetable.csv").toURI());
		importDataFromCSV(csv);
	}

	public static File stream2file(InputStream in) throws IOException {
		final File tempFile = File.createTempFile(PREFIX, SUFFIX);
		tempFile.deleteOnExit();
		try (FileOutputStream out = new FileOutputStream(tempFile)) {
			byte[] buf = new byte[1024];
			int len = 0;
			// 끝까지 읽어들이면서 File 객체에 내용들을 쓴다
			while ((len = in.read(buf)) > 0) {
				out.write(buf, 0, len);
			}
		}
		return tempFile;
	}

	public ArrayList<Class> importDataFromCSV(File file) throws NumberFormatException, IOException, URISyntaxException {
		// System.out.println(reader.readAll());
		int count = 0;
		String[][] hi = getData();
		for (String[] nextLine : hi) {
			// nextLine[] is an array of values from the line
			System.out.println("working" + count + nextLine[6] + nextLine[9]);
			String subjectDepartment = nextLine[5];
			String subjectCode = nextLine[6];
			String subjectName = nextLine[9];
			int subjectScore = Integer.parseInt(nextLine[10]);
			String teacherName = nextLine[11];
			int classNumber = Integer.parseInt(nextLine[4]);
			StringTokenizer st = new StringTokenizer(nextLine[12], "|", false);
			ArrayList<String> classTime = new ArrayList<String>();

			while (st.hasMoreTokens()) {
				classTime.add(st.nextToken());
			}

			Class newClass = new Class(subjectDepartment, subjectName, subjectCode, subjectScore, teacherName, classNumber, classTime);
			classList.add(newClass);
			count++;
		}
		return classList;
	}

	public ArrayList<Class> getClassList() {
		return classList;
	}

	public String[][] getData() {
		String[][] hi = new String[][] {
				new String[] { "1", "2015", "1", "2", "1", "인문예술학부", "HA2301", "인문계열교과선택", "일반", "English Communication", "3", "김주환", "월6|화2|금2" },
				new String[] { "2", "2015", "1", "2", "1", "화학생물학부", "CB4201", "자연계열교과선택", "일반", "감염과면역", "3", "권창섭", "월1|화8|목4" },
				new String[] { "3", "2015", "1", "3", "1", "수리정보과학부", "MC321", "자연계열교과선택", "일반", "객체지향프로그래밍", "3", "김용주", "월4|수2|수3" },
				new String[] { "4", "2015", "1", "3", "2", "수리정보과학부", "MC321", "자연계열교과선택", "일반", "객체지향프로그래밍", "3", "김용주", "화4|목6|목7" },
				new String[] { "5", "2015", "1", "2", "1", "수리정보과학부", "MC1104", "자연계열교과필수", "일반", "고급미적분학1", "5", "김종민", "월10|화9|화10|수4|금3" },
				new String[] { "6", "2015", "1", "2", "2", "수리정보과학부", "MC1104", "자연계열교과필수", "일반", "고급미적분학1", "5", "전영철", "월7|화1|목9|목10|금6" },
				new String[] { "7", "2015", "1", "3", "1", "수리정보과학부", "MC316", "자연계열교과필수", "일반", "고급미적분학3", "4", "김용덕", "월2|월3|수6|목8" },
				new String[] { "8", "2015", "1", "3", "2", "수리정보과학부", "MC316", "자연계열교과필수", "일반", "고급미적분학3", "4", "김종민", "화6|화7|목1|금4" },
				new String[] { "9", "2015", "1", "3", "1", "인문예술학부", "HA234", "인문계열교과선택", "일반", "고급영어독해", "2", "김주환", "화7|목1" },
				new String[] { "10", "2015", "1", "3", "2", "인문예술학부", "HA234", "인문계열교과선택", "일반", "고급영어독해", "2", "김주환", "화4|목7" },
				new String[] { "11", "2015", "1", "3", "3", "인문예술학부", "HA234", "인문계열교과선택", "일반", "고급영어독해", "2", "김주환", "수4|금3" },
				new String[] { "12", "2015", "1", "3", "4", "인문예술학부", "HA234", "인문계열교과선택", "일반", "고급영어독해", "2", "김주환", "수7|목3" },
				new String[] { "13", "2015", "1", "3", "1", "인문예술학부", "HA233", "인문계열교과선택", "일반", "고급영어회화", "2", "Theresa Barrett", "월4|수3" },
				new String[] { "14", "2015", "1", "3", "2", "인문예술학부", "HA233", "인문계열교과선택", "일반", "고급영어회화", "2", "Theresa Barrett", "화4|목7" },
				new String[] { "15", "2015", "1", "3", "3", "인문예술학부", "HA233", "인문계열교과선택", "일반", "고급영어회화", "2", "Theresa Barrett", "수4|금3" },
				new String[] { "16", "2015", "1", "3", "4", "인문예술학부", "HA233", "인문계열교과선택", "일반", "고급영어회화", "2", "Theresa Barrett", "월7|금6" },
				new String[] { "17", "2015", "1", "2", "1", "인문예술학부", "HA6201", "융합학점선택", "일반", "과학의역사와철학", "3", "김재영", "월3|수6|목8" },
				new String[] { "18", "2015", "1", "2", "2", "인문예술학부", "HA6201", "융합학점선택", "일반", "과학의역사와철학", "3", "김재영", "월7|화1|금6" },
				new String[] { "19", "2015", "1", "2", "3", "인문예술학부", "HA6201", "융합학점선택", "일반", "과학의역사와철학", "3", "김재영", "월6|화2|금2" },
				new String[] { "20", "2015", "1", "2", "4", "인문예술학부", "HA6201", "융합학점선택", "일반", "과학의역사와철학", "3", "김재영", "월1|화8|목4" },
				new String[] { "21", "2015", "1", "1", "1", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "여경은", "월2|수6|목8" },
				new String[] { "22", "2015", "1", "1", "2", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "김진실", "화6|목1|금4" },
				new String[] { "23", "2015", "1", "1", "3", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "여경은", "월4|수3|금1" },
				new String[] { "24", "2015", "1", "1", "4", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "여경은", "화4|수1|목6" },
				new String[] { "25", "2015", "1", "1", "5", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "여경은", "화3|수4|금3" },
				new String[] { "26", "2015", "1", "1", "6", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "김진실", "월7|화1|금6" },
				new String[] { "27", "2015", "1", "1", "7", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "여경은", "월1|수7|목4" },
				new String[] { "28", "2015", "1", "1", "8", "인문예술학부", "HA1101", "인문계열교과필수", "일반", "국어1", "3", "김진실", "화2|목2|금7" },
				new String[] { "29", "2015", "1", "2", "1", "물리지구과학부", "PE2102", "자연계열교과선택", "일반", "기초물리학", "3", "이종림", "월6|화2|금2" },
				new String[] { "30", "2015", "1", "1", "1", "수리정보과학부", "MC1105", "자연계열교과필수", "일반", "기초수학", "5", "Jerome Tambour", "월2|월3|수6|목8|금8" },
				new String[] { "31", "2015", "1", "3", "1", "화학생물학부", "CB4102", "자연계열교과선택", "일반", "기초유기화학", "3", "오진호", "월4|수3|금1" },
				new String[] { "32", "2015", "1", "2", "1", "수리정보과학부", "MC3105", "자연계열교과선택", "일반", "기초정수론", "3", "이진희", "월4|수3|금1" },
				new String[] { "33", "2015", "1", "2", "2", "수리정보과학부", "MC3105", "자연계열교과선택", "일반", "기초정수론", "3", "이진희", "화4|수1|목6" },
				new String[] { "34", "2015", "1", "3", "1", "화학생물학부", "CB4104", "자연계열교과선택", "일반", "나노화학의입문", "3", "최은영", "화7|목1|금4" },
				new String[] { "35", "2015", "1", "3", "2", "화학생물학부", "CB4104", "자연계열교과선택", "일반", "나노화학의입문", "3", "최은영", "화4|수1|목6" },
				new String[] { "36", "2015", "1", "2", "1", "수리정보과학부", "MC4201", "자연계열교과선택", "일반", "데이터구조및알고리즘1", "3", "김호숙", "월3|수6|목8" },
				new String[] { "37", "2015", "1", "2", "2", "수리정보과학부", "MC4201", "자연계열교과선택", "일반", "데이터구조및알고리즘1", "3", "김호숙", "화4|수1|목6" },
				new String[] { "38", "2015", "1", "2", "1", "인문예술학부", "HA1103", "인문계열교과필수", "일반", "문학", "3", "장경혜", "월2|수6|목8" },
				new String[] { "39", "2015", "1", "2", "2", "인문예술학부", "HA1103", "인문계열교과필수", "일반", "문학", "3", "장경혜", "화7|목1|금4" },
				new String[] { "40", "2015", "1", "2", "3", "인문예술학부", "HA1103", "인문계열교과필수", "일반", "문학", "3", "장경혜", "월4|수3|금1" },
				new String[] { "41", "2015", "1", "2", "4", "인문예술학부", "HA1103", "인문계열교과필수", "일반", "문학", "3", "장경혜", "화4|수1|목6" },
				new String[] { "42", "2015", "1", "3", "1", "인문예술학부", "HA223", "인문계열교과선택", "일반", "문화경제지리", "3", "김효성", "월4|수2|금1" },
				new String[] { "43", "2015", "1", "3", "2", "인문예술학부", "HA223", "인문계열교과선택", "일반", "문화경제지리", "3", "김효성", "월10|수4|금3" },
				new String[] { "44", "2015", "1", "3", "3", "인문예술학부", "HA223", "인문계열교과선택", "일반", "문화경제지리", "3", "김효성", "화3|수8|목2" },
				new String[] { "45", "2015", "1", "3", "4", "인문예술학부", "HA223", "인문계열교과선택", "일반", "문화경제지리", "3", "김효성", "월6|화2|금2" },
				new String[] { "46", "2015", "1", "3", "5", "인문예술학부", "HA223", "인문계열교과선택", "일반", "문화경제지리", "3", "김효성", "월1|화8|목4" },
				new String[] { "47", "2015", "1", "1", "1", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "김영환", "월2|월3|수6|목8" },
				new String[] { "48", "2015", "1", "1", "2", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "이인숙", "화6|화7|목1|금4" },
				new String[] { "49", "2015", "1", "1", "3", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "전병억", "월4|수2|수3|금1" },
				new String[] { "50", "2015", "1", "1", "4", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "이승국", "화4|수1|목6|목7" },
				new String[] { "51", "2015", "1", "1", "5", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "이승국", "화3|수4|금2|금3" },
				new String[] { "52", "2015", "1", "1", "6", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "최지영", "월6|월7|화1|금6" },
				new String[] { "53", "2015", "1", "1", "7", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "최지영", "월1|수7|수8|목4" },
				new String[] { "54", "2015", "1", "1", "8", "물리지구과학부", "PE1101", "자연계열교과필수", "일반", "물리학및실험1", "3", "최지영", "화2|목2|목3|금7" },
				new String[] { "55", "2015", "1", "1", "1", "물리지구과학부", "PE1103", "자연계열교과필수", "일반", "물리학및실험Ⅰ", "5", "이종림", "월7|화3|목2|금6|금7" },
				new String[] { "56", "2015", "1", "3", "1", "물리지구과학부", "PE5101", "자연계열교과선택", "일반", "물리학특강(기초역학)", "3", "이승국", "월1|화8|목4" },
				new String[] { "57", "2015", "1", "3", "1", "물리지구과학부", "PE5103", "자연계열교과선택", "일반", "물리학특강(레이저의이해와응용)", "3", "김경대", "월2|월3|수6" },
				new String[] { "58", "2015", "1", "3", "1", "수리정보과학부", "MC3107", "자연계열교과선택", "일반", "미분방정식", "3", "김용덕", "화3|수8|목2" },
				new String[] { "59", "2015", "1", "3", "2", "수리정보과학부", "MC3107", "자연계열교과선택", "일반", "미분방정식", "3", "김용덕", "화12|수7|목3" },
				new String[] { "60", "2015", "1", "1", "1", "인문예술학부", "HA1701", "인문계열교과필수", "PF", "미술", "2", "박주영", "월2|월3" },
				new String[] { "61", "2015", "1", "1", "2", "인문예술학부", "HA1701", "인문계열교과필수", "PF", "미술", "2", "박주영", "화6|화7" },
				new String[] { "62", "2015", "1", "1", "3", "인문예술학부", "HA1701", "인문계열교과필수", "PF", "미술", "2", "박주영", "금2|금3" },
				new String[] { "63", "2015", "1", "1", "4", "인문예술학부", "HA1701", "인문계열교과필수", "PF", "미술", "2", "박주영", "수7|수8" },
				new String[] { "64", "2015", "1", "2", "1", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "변종혁", "월8|월9|화6|목1|금4" },
				new String[] { "65", "2015", "1", "2", "2", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "김훈", "월10|화9|화10|수4|금3" },
				new String[] { "66", "2015", "1", "2", "3", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "권민정", "월7|화1|목9|목10|금6" },
				new String[] { "67", "2015", "1", "2", "4", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "임종렬", "월6|화2|목12|목13|금2" },
				new String[] { "68", "2015", "1", "2", "5", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "임종렬", "화12|수7|목3|금7|금8" },
				new String[] { "69", "2015", "1", "2", "6", "수리정보과학부", "MC1103", "자연계열교과필수", "일반", "미적분학1", "5", "이진희", "화12|수7|목3|금7|금8" },
				new String[] { "70", "2015", "1", "3", "1", "수리정보과학부", "MC312", "자연계열교과필수", "일반", "미적분학2", "4", "Jerome Tambour", "화4|수1|목6|목7" },
				new String[] { "71", "2015", "1", "3", "1", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "변종혁", "월2|월3|수6|목8" },
				new String[] { "72", "2015", "1", "3", "2", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "권민정", "화6|화7|목1|금4" },
				new String[] { "73", "2015", "1", "3", "3", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "변종혁", "월4|수2|수3|금1" },
				new String[] { "74", "2015", "1", "3", "4", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "권민정", "화4|수1|목6|목7" },
				new String[] { "75", "2015", "1", "3", "5", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "임종렬", "월2|월3|수6|목8" },
				new String[] { "76", "2015", "1", "3", "6", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "정명주", "월4|수2|수3|금1" },
				new String[] { "77", "2015", "1", "3", "7", "수리정보과학부", "MC313", "자연계열교과필수", "일반", "미적분학3", "4", "김종민", "화4|수1|목6|목7" },
				new String[] { "78", "2015", "1", "2", "1", "화학생물학부", "CB6202", "융합학점선택", "일반", "법과학", "2", "강광일", "월8|월9" },
				new String[] { "79", "2015", "1", "2", "2", "화학생물학부", "CB6202", "융합학점선택", "일반", "법과학", "2", "강광일", "목9|목10" },
				new String[] { "80", "2015", "1", "3", "1", "화학생물학부", "CB421", "자연계열교과선택", "일반", "분자생물학", "3", "KAIST 교수 강의지원", "금6|금7|금8" },
				new String[] { "81", "2015", "1", "1", "1", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "고인정", "월2|월3|수6|목8" },
				new String[] { "82", "2015", "1", "1", "2", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "정미선", "화6|화7|목1|금4" },
				new String[] { "83", "2015", "1", "1", "3", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "정미선", "월4|수2|수3|금1" },
				new String[] { "84", "2015", "1", "1", "4", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "권창섭", "화4|수1|목6|목7" },
				new String[] { "85", "2015", "1", "1", "5", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "이화목", "화3|수4|금2|금3" },
				new String[] { "86", "2015", "1", "1", "6", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "이화목", "월6|월7|화1|금6" },
				new String[] { "87", "2015", "1", "1", "7", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "이화목", "월1|수7|수8|목4" },
				new String[] { "88", "2015", "1", "1", "8", "화학생물학부", "CB1201", "자연계열교과필수", "일반", "생물학및실험1", "3", "정미선", "화2|목2|목3|금7" },
				new String[] { "89", "2015", "1", "2", "1", "화학생물학부", "CB1203", "자연계열교과필수", "일반", "생물학및실험Ⅰ", "5", "고인정", "화12|수7|목3|금7|금8" },
				new String[] { "90", "2015", "1", "3", "1", "화학생물학부", "CB521", "자연계열교과선택", "일반", "생물학특강(인간생물학)", "3", "강광일", "월10|수4|금3" },
				new String[] { "91", "2015", "1", "2", "1", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "류기정", "월8|월9" },
				new String[] { "92", "2015", "1", "2", "2", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "류기정", "목9|목10" },
				new String[] { "93", "2015", "1", "2", "3", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "박주영", "월8|월9" },
				new String[] { "94", "2015", "1", "2", "4", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "박주영", "화9|화10" },
				new String[] { "95", "2015", "1", "2", "5", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "박주영", "목9|목10" },
				new String[] { "96", "2015", "1", "2", "6", "인문예술학부", "HA2701", "인문계열교과선택", "PF", "생활미술", "2", "박주영", "목12|목13" },
				new String[] { "97", "2015", "1", "2", "1", "화학생물학부", "CB2101", "자연계열교과선택", "일반", "생활속의화학", "3", "Naresh Tarte", "화6|화7|금4" },
				new String[] { "98", "2015", "1", "2", "1", "인문예술학부", "HA2601", "인문계열교과선택", "PF", "생활음악", "2", "양리라", "월8|월9" },
				new String[] { "99", "2015", "1", "2", "2", "인문예술학부", "HA2601", "인문계열교과선택", "PF", "생활음악", "2", "장진", "화9|화10" },
				new String[] { "100", "2015", "1", "3", "1", "수리정보과학부", "MC3106", "자연계열교과선택", "일반", "선형대수", "3", "김용덕", "월7|화1|금6" },
				new String[] { "101", "2015", "1", "1", "1", "인문예술학부", "HA1204", "인문계열교과필수", "일반", "세계사1", "2", "박인숙", "화6|화7" },
				new String[] { "102", "2015", "1", "2", "1", "인문예술학부", "HA1203", "인문계열교과필수", "일반", "세계사의이해", "3", "박인숙", "월3|수6|목8" },
				new String[] { "103", "2015", "1", "2", "2", "인문예술학부", "HA1203", "인문계열교과필수", "일반", "세계사의이해", "3", "박인숙", "월10|수4|금3" },
				new String[] { "104", "2015", "1", "2", "3", "인문예술학부", "HA1203", "인문계열교과필수", "일반", "세계사의이해", "3", "박인숙", "월7|화1|금6" },
				new String[] { "105", "2015", "1", "2", "4", "인문예술학부", "HA1203", "인문계열교과필수", "일반", "세계사의이해", "3", "박인숙", "화3|수8|목2" },
				new String[] { "106", "2015", "1", "3", "1", "화학생물학부", "CB422", "자연계열교과선택", "일반", "세포생물학", "3", "KAIST 교수 강의지원", "수8|수9|수10" },
				new String[] { "107", "2015", "1", "1", "1", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "김문수", "월2|월3|수6|목8|금8" },
				new String[] { "108", "2015", "1", "1", "2", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "김문수", "월8|화6|화7|목1|금4" },
				new String[] { "109", "2015", "1", "1", "3", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "박윤주", "월4|수2|수3|목9|금1" },
				new String[] { "110", "2015", "1", "1", "4", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "김병옥", "월8|화4|수1|목6|목7" },
				new String[] { "111", "2015", "1", "1", "5", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "김문수", "월9|화3|수4|금2|금3" },
				new String[] { "112", "2015", "1", "1", "6", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "차성훈", "월6|월7|화1|목9|금6" },
				new String[] { "113", "2015", "1", "1", "7", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "차성훈", "월1|수7|수8|목4|금8" },
				new String[] { "114", "2015", "1", "1", "8", "수리정보과학부", "MC1101", "자연계열교과필수", "일반", "수학1", "5", "김병옥", "월9|화2|목2|목3|금7" },
				new String[] { "115", "2015", "1", "2", "1", "수리정보과학부", "MC1102", "자연계열교과필수", "일반", "수학2", "5", "Jerome Tambour", "월4|화6|화7|목1|금4" },
				new String[] { "116", "2015", "1", "2", "1", "수리정보과학부", "MC2101", "자연계열교과선택", "일반", "수학적문제해결기법", "3", "전영철", "화3|수8|목2" },
				new String[] { "117", "2015", "1", "2", "2", "수리정보과학부", "MC2101", "자연계열교과선택", "일반", "수학적문제해결기법", "3", "전영철", "월1|화8|목4" },
				new String[] { "118", "2015", "1", "3", "1", "수리정보과학부", "MC513", "자연계열교과선택", "일반", "수학특강(논리및집합)", "3", "정명주", "월10|수4|금3" },
				new String[] { "119", "2015", "1", "1", "1", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "김영미", "월3|수6|목8" },
				new String[] { "120", "2015", "1", "1", "2", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "Christopher Callaghan", "화6|목1|금4" },
				new String[] { "121", "2015", "1", "1", "3", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "김영미", "월4|수2|금1" },
				new String[] { "122", "2015", "1", "1", "4", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "김영미", "화4|수1|목7" },
				new String[] { "123", "2015", "1", "1", "5", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "김영미", "화3|수4|금2" },
				new String[] { "124", "2015", "1", "1", "6", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "Christopher Callaghan", "월6|화1|금6" },
				new String[] { "125", "2015", "1", "1", "7", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "Christopher Callaghan", "월1|수8|목4" },
				new String[] { "126", "2015", "1", "1", "8", "인문예술학부", "HA1301", "인문계열교과필수", "일반", "영어1", "3", "Christopher Callaghan", "화2|목3|금7" },
				new String[] { "127", "2015", "1", "2", "1", "인문예술학부", "HA1304", "인문계열교과필수", "일반", "영어독해와작문", "3", "Steven Feldman", "화6|목1|금4" },
				new String[] { "128", "2015", "1", "2", "2", "인문예술학부", "HA1304", "인문계열교과필수", "일반", "영어독해와작문", "3", "Steven Feldman", "화3|수8|목2" },
				new String[] { "129", "2015", "1", "2", "3", "인문예술학부", "HA1304", "인문계열교과필수", "일반", "영어독해와작문", "3", "Steven Feldman", "월6|화2|금2" },
				new String[] { "130", "2015", "1", "2", "4", "인문예술학부", "HA1304", "인문계열교과필수", "일반", "영어독해와작문", "3", "Steven Feldman", "월1|화8|목4" },
				new String[] { "131", "2015", "1", "2", "1", "인문예술학부", "HA1303", "인문계열교과필수", "일반", "영어청해와회화", "3", "Anthony Lee Wilborn", "월3|수6|목8" },
				new String[] { "132", "2015", "1", "2", "2", "인문예술학부", "HA1303", "인문계열교과필수", "일반", "영어청해와회화", "3", "Anthony Lee Wilborn", "화12|수7|목3" },
				new String[] { "133", "2015", "1", "2", "3", "인문예술학부", "HA1303", "인문계열교과필수", "일반", "영어청해와회화", "3", "Anthony Lee Wilborn", "월6|화2|금2" },
				new String[] { "134", "2015", "1", "2", "4", "인문예술학부", "HA1303", "인문계열교과필수", "일반", "영어청해와회화", "3", "Anthony Lee Wilborn", "월1|화8|목4" },
				new String[] { "135", "2015", "1", "2", "5", "인문예술학부", "HA1303", "인문계열교과필수", "일반", "영어청해와회화", "3", "Anthony Lee Wilborn", "월4|수3|금1" },
				new String[] { "136", "2015", "1", "3", "1", "물리지구과학부", "PE4202", "자연계열교과선택", "일반", "우주과학및실습", "3", "박선미", "월6|화2|금2" },
				new String[] { "137", "2015", "1", "1", "1", "인문예술학부", "HA1601", "인문계열교과필수", "PF", "음악", "2", "양리라", "수3|금1" },
				new String[] { "138", "2015", "1", "1", "2", "인문예술학부", "HA1601", "인문계열교과필수", "PF", "음악", "2", "양리라", "수1|목6" },
				new String[] { "139", "2015", "1", "1", "3", "인문예술학부", "HA1601", "인문계열교과필수", "PF", "음악", "2", "양리라", "월7|금6" },
				new String[] { "140", "2015", "1", "1", "4", "인문예술학부", "HA1601", "인문계열교과필수", "PF", "음악", "2", "양리라", "화2|목3" },
				new String[] { "141", "2015", "1", "3", "1", "수리정보과학부", "MC3202", "자연계열교과선택", "일반", "이산구조", "3", "윤상현", "화3|수8|목2" },
				new String[] { "142", "2015", "1", "2", "1", "물리지구과학부", "PE3101", "자연계열교과선택", "일반", "일반물리학1", "4", "김영환", "월4|수2|수3|금1" },
				new String[] { "143", "2015", "1", "2", "1", "물리지구과학부", "EPE3101", "자연계열교과선택", "일반", "일반물리학1(EC)", "4", "이인숙", "월2|월3|수6|목8" },
				new String[] { "144", "2015", "1", "2", "2", "물리지구과학부", "EPE3101", "자연계열교과선택", "일반", "일반물리학1(EC)", "4", "Salavat M. Ishikaev",
						"화6|화7|목1|금4" },
				new String[] { "145", "2015", "1", "2", "3", "물리지구과학부", "EPE3101", "자연계열교과선택", "일반", "일반물리학1(EC)", "4", "이인숙", "화4|수1|목6|목7" },
				new String[] { "146", "2015", "1", "3", "1", "물리지구과학부", "EPE3103", "자연계열교과선택", "일반", "일반물리학2(EC)", "4", "Salavat M. Ishikaev",
						"월4|수2|수3|금1" },
				new String[] { "147", "2015", "1", "3", "2", "물리지구과학부", "EPE3103", "자연계열교과선택", "일반", "일반물리학2(EC)", "4", "Salavat M. Ishikaev",
						"화4|수1|목6|목7" },
				new String[] { "148", "2015", "1", "2", "1", "물리지구과학부", "PE3102", "자연계열교과선택", "일반", "일반물리학실험1", "1", "전병억", "목9|목10" },
				new String[] { "149", "2015", "1", "2", "2", "물리지구과학부", "PE3102", "자연계열교과선택", "일반", "일반물리학실험1", "1", "김경대", "목12|목13" },
				new String[] { "150", "2015", "1", "2", "3", "물리지구과학부", "PE3102", "자연계열교과선택", "일반", "일반물리학실험1", "1", "전병억", "금7|금8" },
				new String[] { "151", "2015", "1", "3", "1", "물리지구과학부", "PE3104", "자연계열교과선택", "일반", "일반물리학실험2", "1", "전병억", "월8|월9" },
				new String[] { "152", "2015", "1", "3", "2", "물리지구과학부", "PE3104", "자연계열교과선택", "일반", "일반물리학실험2", "1", "전병억", "목12|목13" },
				new String[] { "153", "2015", "1", "2", "1", "화학생물학부", "CB3201", "자연계열교과선택", "일반", "일반생물학1", "4", "안정훈", "월4|수2|수3|금1" },
				new String[] { "154", "2015", "1", "2", "1", "화학생물학부", "ECB3201", "자연계열교과선택", "일반", "일반생물학1(EC)", "4", "안정훈", "월2|월3|수6|목8" },
				new String[] { "155", "2015", "1", "2", "2", "화학생물학부", "ECB3201", "자연계열교과선택", "일반", "일반생물학1(EC)", "4", "안정훈", "화6|화7|목1|금4" },
				new String[] { "156", "2015", "1", "2", "1", "화학생물학부", "CB3202", "자연계열교과선택", "일반", "일반생물학실험", "1", "강광일", "목12|목13" },
				new String[] { "157", "2015", "1", "2", "2", "화학생물학부", "CB3202", "자연계열교과선택", "일반", "일반생물학실험", "1", "권창섭", "금7|금8" },
				new String[] { "158", "2015", "1", "2", "1", "물리지구과학부", "PE3203", "자연계열교과선택", "일반", "일반지구과학", "3", "최현정", "월10|수4|금3" },
				new String[] { "159", "2015", "1", "2", "2", "물리지구과학부", "PE3203", "자연계열교과선택", "일반", "일반지구과학", "3", "송인옥", "화3|수8|목2" },
				new String[] { "160", "2015", "1", "2", "3", "물리지구과학부", "PE3203", "자연계열교과선택", "일반", "일반지구과학", "3", "최현정", "월6|화2|금2" },
				new String[] { "161", "2015", "1", "2", "1", "물리지구과학부", "PE3204", "자연계열교과선택", "일반", "일반지구과학실험", "1", "김은지", "목9|목10" },
				new String[] { "162", "2015", "1", "2", "2", "물리지구과학부", "PE3204", "자연계열교과선택", "일반", "일반지구과학실험", "1", "김은지", "목12|목13" },
				new String[] { "163", "2015", "1", "2", "3", "물리지구과학부", "PE3204", "자연계열교과선택", "일반", "일반지구과학실험", "1", "김은지", "금7|금8" },
				new String[] { "164", "2015", "1", "2", "1", "물리지구과학부", "PE3201", "자연계열교과선택", "일반", "일반천문학", "3", "박선미", "월4|수3|금1" },
				new String[] { "165", "2015", "1", "2", "2", "물리지구과학부", "PE3201", "자연계열교과선택", "일반", "일반천문학", "3", "박선미", "화12|수7|목3" },
				new String[] { "166", "2015", "1", "2", "1", "물리지구과학부", "PE3202", "자연계열교과선택", "일반", "일반천문학실험", "1", "박선미", "월8|월9" },
				new String[] { "167", "2015", "1", "2", "2", "물리지구과학부", "PE3202", "자연계열교과선택", "일반", "일반천문학실험", "1", "송인옥", "화9|화10" },
				new String[] { "168", "2015", "1", "2", "1", "화학생물학부", "CB3101", "자연계열교과선택", "일반", "일반화학1", "4", "한상준", "월2|월3|수6|목8" },
				new String[] { "169", "2015", "1", "2", "2", "화학생물학부", "CB3101", "자연계열교과선택", "일반", "일반화학1", "4", "한상준", "화6|화7|목1|금4" },
				new String[] { "170", "2015", "1", "2", "3", "화학생물학부", "CB3101", "자연계열교과선택", "일반", "일반화학1", "4", "김원전", "화4|수1|목6|목7" },
				new String[] { "171", "2015", "1", "3", "1", "화학생물학부", "CB3103", "자연계열교과선택", "일반", "일반화학2", "4", "천만석", "월2|월3|수6|목8" },
				new String[] { "172", "2015", "1", "2", "1", "화학생물학부", "CB3102", "자연계열교과선택", "일반", "일반화학실험1", "1", "Naresh Tarte", "월8|월9" },
				new String[] { "173", "2015", "1", "2", "2", "화학생물학부", "CB3102", "자연계열교과선택", "일반", "일반화학실험1", "1", "Naresh Tarte", "화9|화10" },
				new String[] { "174", "2015", "1", "2", "3", "화학생물학부", "CB3102", "자연계열교과선택", "일반", "일반화학실험1", "1", "Naresh Tarte", "목9|목10" },
				new String[] { "175", "2015", "1", "3", "1", "화학생물학부", "CB3104", "자연계열교과선택", "일반", "일반화학실험2", "1", "오진호", "금7|금8" },
				new String[] { "176", "2015", "1", "1", "1", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김용주", "월2|월3" },
				new String[] { "177", "2015", "1", "2", "1", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "윤상현", "목9|목10" },
				new String[] { "178", "2015", "1", "1", "2", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김용주", "화6|화7" },
				new String[] { "179", "2015", "1", "1", "3", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "윤상현", "수2|수3" },
				new String[] { "180", "2015", "1", "1", "4", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "윤상현", "목6|목7" },
				new String[] { "181", "2015", "1", "1", "5", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김용주", "금2|금3" },
				new String[] { "182", "2015", "1", "1", "6", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김호숙", "월6|월7" },
				new String[] { "183", "2015", "1", "1", "7", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김호숙", "수7|수8" },
				new String[] { "184", "2015", "1", "1", "8", "수리정보과학부", "MC1201", "자연계열교과필수", "일반", "정보과학1", "2", "김호숙", "목2|목3" },
				new String[] { "185", "2015", "1", "2", "1", "수리정보과학부", "MC2201", "자연계열교과선택", "일반", "정보과학3", "3", "정현우", "월7|화1|금6" },
				new String[] { "186", "2015", "1", "2", "2", "수리정보과학부", "MC2201", "자연계열교과선택", "일반", "정보과학3", "3", "윤상현", "월6|화2|금2" },
				new String[] { "187", "2015", "1", "2", "3", "수리정보과학부", "MC2201", "자연계열교과선택", "일반", "정보과학3", "3", "정현우", "월1|화8|목4" },
				new String[] { "188", "2015", "1", "3", "1", "인문예술학부", "HA222", "인문계열교과선택", "일반", "정치경제학", "3", "김상현", "화12|수7|목3" },
				new String[] { "189", "2015", "1", "2", "1", "인문예술학부", "HA2202", "인문계열교과선택", "일반", "정치와경제", "3", "한형근", "화6|목1|금4" },
				new String[] { "190", "2015", "1", "2", "2", "인문예술학부", "HA2202", "인문계열교과선택", "일반", "정치와경제", "3", "김상현", "월4|수2|금1" },
				new String[] { "191", "2015", "1", "2", "3", "인문예술학부", "HA2202", "인문계열교과선택", "일반", "정치와경제", "3", "김상현", "월10|수4|금3" },
				new String[] { "192", "2015", "1", "2", "4", "인문예술학부", "HA2202", "인문계열교과선택", "일반", "정치와경제", "3", "한형근", "월7|화1|금6" },
				new String[] { "193", "2015", "1", "2", "1", "물리지구과학부", "PE2202", "자연계열교과선택", "일반", "지구환경과학", "3", "최현정", "월7|화1|금6" },
				new String[] { "194", "2015", "1", "2", "2", "물리지구과학부", "PE2202", "자연계열교과선택", "일반", "지구환경과학", "3", "최현정", "화3|수8|목2" },
				new String[] { "195", "2015", "1", "2", "3", "물리지구과학부", "PE2202", "자연계열교과선택", "일반", "지구환경과학", "3", "박순영", "화12|화13|화14" },
				new String[] { "196", "2015", "1", "2", "1", "물리지구과학부", "PE2201", "자연계열교과선택", "일반", "천체관측의기초", "3", "송인옥", "월10|수4|금3" },
				new String[] { "197", "2015", "1", "2", "2", "물리지구과학부", "PE2201", "자연계열교과선택", "일반", "천체관측의기초", "3", "송인옥", "월6|화2|금2" },
				new String[] { "198", "2015", "1", "2", "3", "물리지구과학부", "PE2201", "자연계열교과선택", "일반", "천체관측의기초", "3", "송인옥", "월1|화8|목4" },
				new String[] { "199", "2015", "1", "3", "1", "인문예술학부", "HA221", "인문계열교과선택", "일반", "철학", "3", "하동윤", "월3|수6|목8" },
				new String[] { "200", "2015", "1", "3", "2", "인문예술학부", "HA221", "인문계열교과선택", "일반", "철학", "3", "하동윤", "화12|수7|목3" },
				new String[] { "201", "2015", "1", "2", "1", "인문예술학부", "HA2201", "인문계열교과선택", "일반", "철학산책", "3", "하동윤", "월4|수2|금1" },
				new String[] { "202", "2015", "1", "2", "2", "인문예술학부", "HA2201", "인문계열교과선택", "일반", "철학산책", "3", "하동윤", "수1|목6|목7" },
				new String[] { "203", "2015", "1", "2", "3", "인문예술학부", "HA2201", "인문계열교과선택", "일반", "철학산책", "3", "하동윤", "월10|수4|금3" },
				new String[] { "204", "2015", "1", "2", "4", "인문예술학부", "HA2201", "인문계열교과선택", "일반", "철학산책", "3", "김상균", "월7|화1|금6" },
				new String[] { "205", "2015", "1", "1", "1", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "수6" },
				new String[] { "206", "2015", "1", "1", "2", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "금4" },
				new String[] { "207", "2015", "1", "1", "3", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "월4" },
				new String[] { "208", "2015", "1", "1", "4", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "수1" },
				new String[] { "209", "2015", "1", "1", "5", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "화3" },
				new String[] { "210", "2015", "1", "1", "6", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "금6" },
				new String[] { "211", "2015", "1", "1", "7", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "월1" },
				new String[] { "212", "2015", "1", "1", "8", "인문예술학부", "HA1801", "인문계열교과필수", "PF", "체육1", "1", "이민택", "화2" },
				new String[] { "213", "2015", "1", "2", "1", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "월2" },
				new String[] { "214", "2015", "1", "2", "2", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "화7" },
				new String[] { "215", "2015", "1", "2", "3", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "수3" },
				new String[] { "216", "2015", "1", "2", "4", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "목7" },
				new String[] { "217", "2015", "1", "2", "5", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "목2" },
				new String[] { "218", "2015", "1", "2", "6", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "목3" },
				new String[] { "219", "2015", "1", "2", "7", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "월8" },
				new String[] { "220", "2015", "1", "2", "8", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "목9" },
				new String[] { "221", "2015", "1", "2", "9", "인문예술학부", "HA1803", "인문계열교과필수", "PF", "체육3", "1", "이민택", "금7" },
				new String[] { "222", "2015", "1", "2", "1", "물리지구과학부", "PE2101", "자연계열교과선택", "일반", "탐구물리", "3", "김영환", "화6|화7|금4" },
				new String[] { "223", "2015", "1", "2", "1", "인문예술학부", "HA1206", "인문계열교과필수", "일반", "한국사1", "2", "강재순", "월7|금6" },
				new String[] { "224", "2015", "1", "1", "1", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "우정임", "수6|목8" },
				new String[] { "225", "2015", "1", "1", "2", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "강재순", "목1|금4" },
				new String[] { "226", "2015", "1", "1", "3", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "우정임", "월4|수2" },
				new String[] { "227", "2015", "1", "1", "4", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "강재순", "화4|목7" },
				new String[] { "228", "2015", "1", "1", "5", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "강재순", "화3|수4" },
				new String[] { "229", "2015", "1", "1", "6", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "강재순", "월6|화1" },
				new String[] { "230", "2015", "1", "1", "7", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "우정임", "월1|목4" },
				new String[] { "231", "2015", "1", "1", "8", "인문예술학부", "HA1201", "인문계열교과필수", "일반", "한국사의이해1", "2", "강재순", "목2|금7" },
				new String[] { "232", "2015", "1", "1", "1", "인문예술학부", "HA1104", "인문계열교과필수", "일반", "한국어Ⅰ", "4", "노초롱", "월8|월9|화4|목7" },
				new String[] { "233", "2015", "1", "2", "1", "인문예술학부", "HA1106", "인문계열교과필수", "일반", "한국어Ⅲ", "4", "원윤희", "월8|월9|수9|수10" },
				new String[] { "234", "2015", "1", "3", "1", "물리지구과학부", "PE4101", "자연계열교과선택", "일반", "현대물리학개론", "3", "이종림", "월1|화8|목4" },
				new String[] { "235", "2015", "1", "3", "1", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "김동화", "월10|수4|금3" },
				new String[] { "236", "2015", "1", "3", "2", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "이춘근", "월7|화1|금6" },
				new String[] { "237", "2015", "1", "3", "3", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "이춘근", "화3|수8|목2" },
				new String[] { "238", "2015", "1", "3", "4", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "이춘근", "월1|화8|목4" },
				new String[] { "239", "2015", "1", "3", "5", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "이춘근", "월6|화2|금2" },
				new String[] { "240", "2015", "1", "3", "6", "인문예술학부", "HA211", "인문계열교과선택", "일반", "화법", "3", "김진실", "월1|화8|목4" },
				new String[] { "241", "2015", "1", "3", "1", "화학생물학부", "CB4101", "자연계열교과선택", "일반", "화학과에너지", "3", "조철희", "월7|화1|금6" },
				new String[] { "242", "2015", "1", "1", "1", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "최은영", "월2|월3|수6|목8" },
				new String[] { "243", "2015", "1", "1", "2", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "오진호", "화6|화7|목1|금4" },
				new String[] { "244", "2015", "1", "1", "3", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "한상준", "월4|수2|수3|금1" },
				new String[] { "245", "2015", "1", "1", "4", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "천만석", "화4|수1|목6|목7" },
				new String[] { "246", "2015", "1", "1", "5", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "천만석", "화3|수4|금2|금3" },
				new String[] { "247", "2015", "1", "1", "6", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "김원전", "월6|월7|화1|금6" },
				new String[] { "248", "2015", "1", "1", "7", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "김원전", "월1|수7|수8|목4" },
				new String[] { "249", "2015", "1", "1", "8", "화학생물학부", "CB1101", "자연계열교과필수", "일반", "화학및실험1", "3", "최은영", "화2|목2|목3|금7" },
				new String[] { "250", "2015", "1", "1", "1", "화학생물학부", "CB1103", "자연계열교과필수", "일반", "화학및실험Ⅰ", "5", "Naresh Tarte", "월6|화1|화2|수4|목3" },
				new String[] { "251", "2015", "1", "3", "1", "수리정보과학부", "MC3108", "자연계열교과선택", "일반", "확률및통계", "3", "박윤주", "화3|수8|목2" },
				new String[] { "252", "2015", "1", "3", "2", "수리정보과학부", "MC3108", "자연계열교과선택", "일반", "확률및통계", "3", "박윤주", "월6|화2|금2" },
				new String[] { "253", "2015", "1", "3", "3", "수리정보과학부", "MC3108", "자연계열교과선택", "일반", "확률및통계", "3", "정명주", "월1|화8|목4" }

		};
		return hi;
	}
}
